Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
                             + refId          = "A"
                            },
                        ]
                      + title         = "Internal Storage Queue Length"
                      + type          = "stat"
                    },
                  + {
                      + datasource    = {
                          + type = "datasource"
                          + uid  = "grafana"
                        }
                      + editable      = true
                      + error         = false
                      + gridPos       = {
                          + h = 5
                          + w = 6
                          + x = 18
                          + y = 0
                        }
                      + links         = []
                      + options       = {
                          + code    = {
                              + language        = "plaintext"
                              + showLineNumbers = false
                              + showMiniMap     = false
                            }
                          + content = <<-EOT
                                <span style="font-family: 'Open Sans', 'Helvetica Neue', Helvetica; font-size: 25px;vertical-align: text-top;color: #bbbfc2;margin-left: 10px;">Prometheus</span>
                                
                                <p style="margin-top: 10px;">You're using Prometheus, an open-source systems monitoring and alerting toolkit originally built at SoundCloud. For more information, check out the <a href="https://grafana.com/">Grafana</a> and <a href="http://prometheus.io/">Prometheus</a> projects.</p>
                            EOT
                          + mode    = "html"
                        }
                      + pluginVersion = "10.0.0"
                      + style         = {}
                      + targets       = [
                          + {
                              + datasource = {
                                  + type = "datasource"
                                  + uid  = "grafana"
                                }
                              + refId      = "A"
                            },
                        ]
                      + transparent   = true
                      + type          = "text"
                    },
                  + {
                      + datasource    = {
                          + type = "prometheus"
                          + uid  = "${DS_PROMETHEUS}"
                        }
                      + fieldConfig   = {
                          + defaults  = {
                              + color      = {
                                  + mode = "palette-classic"
                                }
                              + custom     = {
                                  + axisCenteredZero  = false
                                  + axisColorMode     = "text"
                                  + axisLabel         = ""
                                  + axisPlacement     = "auto"
                                  + barAlignment      = 0
                                  + drawStyle         = "line"
                                  + fillOpacity       = 10
                                  + gradientMode      = "none"
                                  + hideFrom          = {
                                      + legend  = false
                                      + tooltip = false
                                      + viz     = false
                                    }
                                  + lineInterpolation = "linear"
                                  + lineWidth         = 2
                                  + pointSize         = 5
                                  + scaleDistribution = {
                                      + type = "linear"
                                    }
                                  + showPoints        = "never"
                                  + spanNulls         = false
                                  + stacking          = {
                                      + group = "A"
                                      + mode  = "none"
                                    }
                                  + thresholdsStyle   = {
                                      + mode = "off"
                                    }
                                }
                              + links      = []
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "red"
                                          + value = 80
                                        },
                                    ]
                                }
                              + unit       = "short"
                            }
                          + overrides = [
                              + {
                                  + matcher    = {
                                      + id      = "byName"
                                      + options = "prometheus"
                                    }
                                  + properties = [
                                      + {
                                          + id    = "color"
                                          + value = {
                                              + fixedColor = "#C15C17"
                                              + mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              + {
                                  + matcher    = {
                                      + id      = "byName"
                                      + options = "{instance=\"localhost:9090\",job=\"prometheus\"}"
                                    }
                                  + properties = [
                                      + {
                                          + id    = "color"
                                          + value = {
                                              + fixedColor = "#C15C17"
                                              + mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      + gridPos       = {
                          + h = 6
                          + w = 18
                          + x = 0
                          + y = 5
                        }
                      + links         = []
                      + options       = {
                          + legend  = {
                              + calcs       = []
                              + displayMode = "list"
                              + placement   = "bottom"
                              + showLegend  = true
                            }
                          + tooltip = {
                              + mode = "single"
                              + sort = "none"
                            }
                        }
                      + pluginVersion = "8.1.0-pre"
                      + targets       = [
                          + {
                              + datasource     = {
                                  + type = "prometheus"
                                  + uid  = "${DS_PROMETHEUS}"
                                }
                              + expr           = "rate(prometheus_local_storage_ingested_samples_total{instance=~\"$node\"}[5m])"
                              + interval       = ""
                              + intervalFactor = 2
                              + legendFormat   = "{{job}}"
                              + metric         = ""
                              + refId          = "A"
                            },
                        ]
                      + title         = "Samples ingested (rate-5m)"
                      + type          = "timeseries"
                    },
                  + {
                      + datasource    = {
                          + type = "datasource"
                          + uid  = "grafana"
                        }
                      + editable      = true
                      + error         = false
                      + gridPos       = {
                          + h = 6
                          + w = 4
                          + x = 18
                          + y = 5
                        }
                      + links         = []
                      + options       = {
                          + code    = {
                              + language        = "plaintext"
                              + showLineNumbers = false
                              + showMiniMap     = false
                            }
                          + content = <<-EOT
                                #### Samples Ingested
                                This graph displays the count of samples ingested by the Prometheus server, as measured over the last 5 minutes, per time series in the range vector. When troubleshooting an issue on IRC or GitHub, this is often the first stat requested by the Prometheus team.
                            EOT
                          + mode    = "markdown"
                        }
                      + pluginVersion = "10.0.0"
                      + style         = {}
                      + targets       = [
                          + {
                              + datasource = {
                                  + type = "datasource"
                                  + uid  = "grafana"
                                }
                              + refId      = "A"
                            },
                        ]
                      + transparent   = true
                      + type          = "text"
                    },
                  + {
                      + datasource    = {
                          + type = "prometheus"
                          + uid  = "${DS_PROMETHEUS}"
                        }
                      + fieldConfig   = {
                          + defaults  = {
                              + color      = {
                                  + mode = "palette-classic"
                                }
                              + custom     = {
                                  + axisCenteredZero  = false
                                  + axisColorMode     = "text"
                                  + axisLabel         = ""
                                  + axisPlacement     = "auto"
                                  + barAlignment      = 0
                                  + drawStyle         = "line"
                                  + fillOpacity       = 10
                                  + gradientMode      = "none"
                                  + hideFrom          = {
                                      + legend  = false
                                      + tooltip = false
                                      + viz     = false
                                    }
                                  + lineInterpolation = "linear"
                                  + lineWidth         = 2
                                  + pointSize         = 5
                                  + scaleDistribution = {
                                      + type = "linear"
                                    }
                                  + showPoints        = "never"
                                  + spanNulls         = false
                                  + stacking          = {
                                      + group = "A"
                                      + mode  = "none"
                                    }
                                  + thresholdsStyle   = {
                                      + mode = "off"
                                    }
                                }
                              + links      = []
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "red"
                                          + value = 80
                                        },
                                    ]
                                }
                              + unit       = "short"
                            }
                          + overrides = [
                              + {
                                  + matcher    = {
                                      + id      = "byName"
                                      + options = "prometheus"
                                    }
                                  + properties = [
                                      + {
                                          + id    = "color"
                                          + value = {
                                              + fixedColor = "#F9BA8F"
                                              + mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              + {
                                  + matcher    = {
                                      + id      = "byName"
                                      + options = "{instance=\"localhost:9090\",interval=\"5s\",job=\"prometheus\"}"
                                    }
                                  + properties = [
                                      + {
                                          + id    = "color"
                                          + value = {
                                              + fixedColor = "#F9BA8F"
                                              + mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      + gridPos       = {
                          + h = 7
                          + w = 10
                          + x = 0
                          + y = 11
                        }
                      + links         = []
                      + options       = {
                          + legend  = {
                              + calcs       = []
                              + displayMode = "list"
                              + placement   = "bottom"
                              + showLegend  = true
                            }
                          + tooltip = {
                              + mode = "single"
                              + sort = "none"
                            }
                        }
                      + pluginVersion = "8.1.0-pre"
                      + targets       = [
                          + {
                              + datasource     = {
                                  + type = "prometheus"
                                  + uid  = "${DS_PROMETHEUS}"
                                }
                              + expr           = "rate(prometheus_target_interval_length_seconds_count{instance=~\"$node\"}[5m])"
                              + intervalFactor = 2
                              + legendFormat   = "{{job}}"
                              + refId          = "A"
                            },
                        ]
                      + title         = "Target Scrapes (last 5m)"
                      + type          = "timeseries"
                    },
                  + {
                      + datasource    = {
                          + type = "prometheus"
                          + uid  = "${DS_PROMETHEUS}"
                        }
                      + fieldConfig   = {
                          + defaults  = {
                              + color      = {
                                  + mode = "palette-classic"
                                }
                              + custom     = {
                                  + axisCenteredZero  = false
                                  + axisColorMode     = "text"
                                  + axisLabel         = ""
                                  + axisPlacement     = "auto"
                                  + barAlignment      = 0
                                  + drawStyle         = "line"
                                  + fillOpacity       = 10
                                  + gradientMode      = "none"
                                  + hideFrom          = {
                                      + legend  = false
                                      + tooltip = false
                                      + viz     = false
                                    }
                                  + lineInterpolation = "linear"
                                  + lineWidth         = 2
                                  + pointSize         = 5
                                  + scaleDistribution = {
                                      + type = "linear"
                                    }
                                  + showPoints        = "never"
                                  + spanNulls         = false
                                  + stacking          = {
                                      + group = "A"
                                      + mode  = "none"
                                    }
                                  + thresholdsStyle   = {
                                      + mode = "off"
                                    }
                                }
                              + links      = []
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "red"
                                          + value = 80
                                        },
                                    ]
                                }
                              + unit       = "short"
                            }
                          + overrides = []
                        }
                      + gridPos       = {
                          + h = 7
                          + w = 8
                          + x = 10
                          + y = 11
                        }
                      + links         = []
                      + options       = {
                          + legend  = {
                              + calcs       = []
                              + displayMode = "list"
                              + placement   = "bottom"
                              + showLegend  = true
                            }
                          + tooltip = {
                              + mode = "single"
                              + sort = "none"
                            }
                        }
                      + pluginVersion = "8.1.0-pre"
                      + targets       = [
                          + {
                              + datasource     = {
                                  + type = "prometheus"
                                  + uid  = "${DS_PROMETHEUS}"
                                }
                              + expr           = "prometheus_target_interval_length_seconds{quantile!=\"0.01\", quantile!=\"0.05\",instance=~\"$node\"}"
                              + interval       = ""
                              + intervalFactor = 2
                              + legendFormat   = "{{quantile}} ({{interval}})"
                              + metric         = ""
                              + refId          = "A"
                            },
                        ]
                      + title         = "Scrape Duration"
                      + type          = "timeseries"
                    },
                  + {
                      + datasource    = {
                          + type = "datasource"
                          + uid  = "grafana"
                        }
                      + editable      = true
                      + error         = false
                      + gridPos       = {
                          + h = 7
                          + w = 6
                          + x = 18
                          + y = 11
                        }
                      + links         = []
                      + options       = {
                          + code    = {
                              + language        = "plaintext"
                              + showLineNumbers = false
                              + showMiniMap     = false
                            }
                          + content = <<-EOT
                                #### Scrapes
                                Prometheus scrapes metrics from instrumented jobs, either directly or via an intermediary push gateway for short-lived jobs. Target scrapes will show how frequently targets are scraped, as measured over the last 5 minutes, per time series in the range vector. Scrape Duration will show how long the scrapes are taking, with percentiles available as series.
                            EOT
                          + mode    = "markdown"
                        }
                      + pluginVersion = "10.0.0"
                      + style         = {}
                      + targets       = [
                          + {
                              + datasource = {
                                  + type = "datasource"
                                  + uid  = "grafana"
                                }
                              + refId      = "A"
                            },
                        ]
                      + transparent   = true
                      + type          = "text"
                    },
                  + {
                      + datasource    = {
                          + type = "prometheus"
                          + uid  = "${DS_PROMETHEUS}"
                        }
                      + fieldConfig   = {
                          + defaults  = {
                              + color      = {
                                  + mode = "palette-classic"
                                }
                              + custom     = {
                                  + axisCenteredZero  = false
                                  + axisColorMode     = "text"
                                  + axisLabel         = ""
                                  + axisPlacement     = "auto"
                                  + barAlignment      = 0
                                  + drawStyle         = "line"
                                  + fillOpacity       = 10
                                  + gradientMode      = "none"
                                  + hideFrom          = {
                                      + legend  = false
                                      + tooltip = false
                                      + viz     = false
                                    }
                                  + lineInterpolation = "linear"
                                  + lineWidth         = 2
                                  + pointSize         = 5
                                  + scaleDistribution = {
                                      + type = "linear"
                                    }
                                  + showPoints        = "never"
                                  + spanNulls         = false
                                  + stacking          = {
                                      + group = "A"
                                      + mode  = "none"
                                    }
                                  + thresholdsStyle   = {
                                      + mode = "off"
                                    }
                                }
                              + links      = []
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "red"
                                          + value = 80
                                        },
                                    ]
                                }
                              + unit       = "percentunit"
                            }
                          + overrides = []
                        }
                      + gridPos       = {
                          + h = 7
                          + w = 18
                          + x = 0
                          + y = 18
                        }
                      + links         = []
                      + options       = {
                          + legend  = {
                              + calcs       = []
                              + displayMode = "list"
                              + placement   = "bottom"
                              + showLegend  = true
                            }
                          + tooltip = {
                              + mode = "single"
                              + sort = "none"
                            }
                        }
                      + pluginVersion = "8.1.0-pre"
                      + targets       = [
                          + {
                              + datasource     = {
                                  + type = "prometheus"
                                  + uid  = "${DS_PROMETHEUS}"
                                }
                              + expr           = "prometheus_evaluator_duration_seconds{quantile!=\"0.01\", quantile!=\"0.05\",instance=~\"$node\"}"
                              + interval       = ""
                              + intervalFactor = 2
                              + legendFormat   = "{{quantile}}"
                              + refId          = "A"
                            },
                        ]
                      + title         = "Rule Eval Duration"
                      + type          = "timeseries"
                    },
                  + {
                      + datasource    = {
                          + type = "datasource"
                          + uid  = "grafana"
                        }
                      + editable      = true
                      + error         = false
                      + gridPos       = {
                          + h = 7
                          + w = 6
                          + x = 18
                          + y = 18
                        }
                      + links         = []
                      + options       = {
                          + code    = {
                              + language        = "plaintext"
                              + showLineNumbers = false
                              + showMiniMap     = false
                            }
                          + content = <<-EOT
                                #### Rule Evaluation Duration
                                This graph panel plots the duration for all evaluations to execute. The 50th percentile, 90th percentile and 99th percentile are shown as three separate series to help identify outliers that may be skewing the data.
                            EOT
                          + mode    = "markdown"
                        }
                      + pluginVersion = "10.0.0"
                      + style         = {}
                      + targets       = [
                          + {
                              + datasource = {
                                  + type = "datasource"
                                  + uid  = "grafana"
                                }
                              + refId      = "A"
                            },
                        ]
                      + transparent   = true
                      + type          = "text"
                    },
                ]
              + refresh              = ""
              + revision             = "1.0"
              + schemaVersion        = 38
              + style                = "dark"
              + tags                 = [
                  + "prometheus",
                ]
              + templating           = {
                  + list = [
                      + {
                          + current        = {}
                          + datasource     = {
                              + type = "prometheus"
                              + uid  = "${DS_PROMETHEUS}"
                            }
                          + definition     = ""
                          + hide           = 0
                          + includeAll     = false
                          + label          = "HOST:"
                          + multi          = false
                          + name           = "node"
                          + options        = []
                          + query          = {
                              + query = "label_values(prometheus_build_info, instance)"
                              + refId = "gdev-prometheus-node-Variable-Query"
                            }
                          + refresh        = 1
                          + regex          = ""
                          + skipUrlSync    = false
                          + sort           = 1
                          + tagValuesQuery = ""
                          + tagsQuery      = ""
                          + type           = "query"
                          + useTags        = false
                        },
                    ]
                }
              + time                 = {
                  + from = "now-5m"
                  + to   = "now"
                }
              + timepicker           = {
                  + now               = true
                  + refresh_intervals = [
                      + "5s",
                      + "10s",
                      + "30s",
                      + "1m",
                      + "5m",
                      + "15m",
                      + "30m",
                      + "1h",
                      + "2h",
                      + "1d",
                    ]
                  + time_options      = [
                      + "5m",
                      + "15m",
                      + "1h",
                      + "6h",
                      + "12h",
                      + "24h",
                      + "2d",
                      + "7d",
                      + "30d",
                    ]
                }
              + timezone             = "browser"
              + title                = "Prometheus Stats"
              + uid                  = "rpfmFFz7z"
              + weekStart            = ""
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_data_source.elastic will be created
+ resource "grafana_data_source" "elastic" {
      + access_mode              = "proxy"
      + basic_auth_enabled       = true
      + id                       = (known after apply)
      + is_default               = false
      + json_data_encoded        = jsonencode(
            {
              + index = "logs-*"
            }
        )
      + name                     = "elastic"
      + secure_json_data_encoded = (sensitive value)
      + type                     = "elastic"
      + uid                      = (known after apply)
      + url                      = "http://homelab-es-elastic.elastic"
    }

  # grafana_data_source.github will be created
+ resource "grafana_data_source" "github" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + owner = ""
            }
        )
      + name               = "Github"
      + type               = "grafana-github-datasource"
      + uid                = (known after apply)
    }

  # grafana_data_source.prometheus will be created
+ resource "grafana_data_source" "prometheus" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + name               = "Prometheus"
      + type               = "prometheus"
      + uid                = (known after apply)
      + url                = "http://prometheus.local.net"
    }

  # grafana_folder.homelab will be created
+ resource "grafana_folder" "homelab" {
      + id                           = (known after apply)
      + prevent_destroy_if_not_empty = false
      + title                        = "Homelab"
      + uid                          = (known after apply)
      + url                          = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p grafana`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=mvaldes14%252Fterraform%252Fapps%252Fgrafana%252Fgrafana)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p grafana`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 9 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`